# CableTraySizes Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
CableTraySizes Class
Members See Also
---
Cable tray sizes.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public class CableTraySizes : Element,
	IEnumerable<MEPSize>
```

Visual Basic
---
```text
Public Class CableTraySizes _
	Inherits Element _
	Implements IEnumerable(Of MEPSize)
```

Visual C++
---
```text
public ref class CableTraySizes : public Element,
	IEnumerable<MEPSize^>
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Electrical..::..CableTraySizes
# See Also
CableTraySizes Members
Autodesk.Revit.DB.Electrical Namespace